"""
Name: [ธารมาส แก้วมณ๊]
SID: [36411760010]
Group: [MIT211]
"""

myList = [10,20,30,40,50]

# แสดงผลข้อมูลใน myList ทั้งหมด
# แสดงผลข้อมูล 20 จาก myList
# แสดงผลข้อมูล 50 จาก myList
# แสดงผลข้อมูล 50 จาก myList โดยใช้ negative index

# แสดงผลข้อมูล [20,30,40] โดยใช้ range index
# แสดงผลข้อมูล [40,50] โดยใช้ range index
# แสดงผลข้อมูล [10,20] โดยใช้ range negative index

# แสดงผลข้อมูลใน myList ทั้งหมด โดยการใช้ while loop

# แสดงผลข้อมูลใน myList ทั้งหมด โดยการใช้ for loop

# เพิ่มข้อมูล 100,200,300 ใน myList
# เพิ่มข้อมูล 400 ใน myList ในตำแหน่งที่ 0
# เพิ่มข้อมูล 500 ใน myList ในตำแหน่งที่ 3
# แสดงผลข้อมูลใน myList ทั้งหมด 

# ลบข้อมูล 10
# ลบข้อมูล 100
# แสดงผลข้อมูลใน myList ทั้งหมด 
# ลบข้อมูลตำแหน่งสุดท้ายใน myList
# แสดงผลข้อมูลใน myList ทั้งหมด 

# เรียงข้อมูล myList จาก น้อย-มาก
# แสดงผลข้อมูลใน myList ทั้งหมด 


# เรียงข้อมูล myList จาก มาก-น้อย
# แสดงผลข้อมูลใน myList ทั้งหมด 

# comprehension
# คัดลอกข้อมูลใน myList ที่มีค่ามากกว่า 50 มาเก็บไว้ใน newList
# แสดงผลข้อมูลใน newList ทั้งหมด 

# นำข้อมูลใน mylist และ newList มารวมกัน และเก็บไว้ในตัวแปร myFinalList
# แสดงผลข้อมูลใน myFinalList ทั้งหมด 
