#Assignment 4
#Computer Programming 2/2564
#MIT211-2


#จงเขียนโปรแกรมหาตัวเลขที่เลข 5 หารลงตัว จากเลข 1 ถึงตัวเลขที่ป้อนทางคีย์บอร์ด
#input: รับจำนวนเต็ม 1 จำนวน
#process: คำนวณหาเลขที่หารด้วย 5 ลงตัว ตั้งแต่ 1 ถึงเลขที่รับมาทางคีย์บอร์ด เพื่อให้ได้คำตอบดังนี้
#จำนวนที่หารด้วย 5 ลงตัวมีกี่จำนวน
#มีตัวเลขใดบ้าง
#output: แสดงตัวเลขว่ามีกี่จำนวน ต่อด้วยตัวเลขที่หารลงตัวโดยแต่ละตัวคั่นด้วยเว้นวรรค เช่น

#Enter number: 20
#The result is 4: 5 10 15 20

#จงเขียนโปรแกรมเก็บตัวเลขที่ป้อนทางคีร์บอร์ด โดยสามารถรับค่าได้เรื่อย ๆ และจะหยุดเมื่อป้อนตัวเลขที่ซ้ำจากตัวเลขที่ป้อนเข้ามาก่อนหน้า
#input: รับตัวเลขจำนวนเต็มไปเรื่อย ๆ ครั้งละ 1 จำนวน
#process: ตรวจสอบว่าตัวเลขที่ัรับมาซ้ำกับตัวเลขที่ป้อนเข้ามาก่อนหน้านี้หรือไม่ ถ้าไม่ซ้ำให้บันทึกค่าไว้และรับค่าต่อ ถ้าซ้ำกับตัวเลขที่
#ป้อนมาก่อนหน้านี้ให้หยุด

#จากข้อที่ 1 และ 2 ให้นำผลลัพท์ที่ได้จากการรันโปรแกรมเขียนลงไฟล์ต่อไปนี้
#ข้อที่ 1 เขียนลงไฟล์ชื่อ A4Q1.txt โดยเขียนตัวเลขที่หารด้วย 5 ลงตัวในไฟล์ เช่น
#5
#10
#15
#20
#ข้อที่ 2 เขียนลงไฟล์ชื่อ A4Q2.txt โดยเขียนตัวเลขที่รับค่ามาได้ทั้งหมดก่อนที่จะรับตัวเลขที่ซ้ำกัน

